<?php
$tests = [ 
/*'title' => 'Волшебник страны Хогвартс: тест на знание «Гарри Поттера»', 
	[ 
		'question' => 'Что находится на лбу Гарри?',
		'answer1' => 'Пятно',
		'answer2' => 'Прыщ',
		'answer3' => 'Эмблема',
		'answer4' => 'Шрам',
	    'correct-answer' => 'Шрам'
	],
	[ 
		'question' => 'Сколько самых верных друзей у Гарри?',
		'answer1' => '3',
		'answer2' => '2',
		'answer3' => '5',
		'answer4' => '4',
		'correct-answer' => '2'
	],
	[	
		'question' => 'Сколько частей фильмов насчитывает похождения Гарри Поттера?',
		'answer1' => '5',
		'answer2' => '6',
		'answer3' => '7',
		'answer4' => '8',
		'correct-answer'  =>  '6'
	],
	[
		'question' => 'Как зовут главного врага Гарри Поттера?',
		'answer1' => 'Волан-Де-Морт',
		'answer2' => 'Рон Уизли',
		'answer3' => 'Сириус Блэк',
		'answer4' => 'Хагрид',
        'correct-answer'  =>  'Волан-Де-Морт'
    ],
	[
		'question' => 'Как называется школа где учится Гарри?',
		'answer1' => 'Годрикова Впадина',
		'answer2' => 'Азкабана',
		'answer3' => 'Хогвардс',
		'answer4' => 'Косой переулок',
		'correct-answer'  =>  'Хогвардс'
	],
	[
		'question' => 'Что ищет Гарри и его друзья в последних двух фильмах?',
		'answer1' => 'Зелье пpавды',
		'answer2' => 'Клык дракона',
		'answer3' => 'Дары смерти',
		'answer4' => 'Меч',
        'correct-answer' => 'Дары смерти'
    ]
];*/

'title' => 'Герои сказок',
	[
	'question' => 'В какой из этих басен и сказок лисице не удалось достичь желаемого?',
	'answer1' => 'Ворона и лисица',
	'answer2' => 'Колобок',
	'answer3' => 'Лиса и виноград',
	'answer4' => 'Кот и лиса',
    'correct-answer' => 'Колобок'
	],
    [
	'question' => 'Кем стал братец Иванушка, ослушавшись сестрицу Аленушку?',
	'answer1' => 'Ягненочком',
	'answer2' => 'Теленочком',
	'answer3' => 'Козленочком',
	'answer4' => 'Жеребеночком',
    'correct-answer' => 'Козленочком'
	],
	[
	'question' => 'Какого из этих животных не было среди Бременских музыкантов?',
	'answer1' => 'Осла',
	'answer2' => 'Козла',
	'answer3' => 'Петуха',
	'answer4' => 'Кoта',
    'correct-answer' => 'Козла'
	],
	[
	'question' => 'У какого из этих героев в голове были одни опилки?',
	'answer1' => 'Буратино',
	'answer2' => 'Винни-Пух',
	'answer3' => 'Страшила',
	'answer4' => 'Чебурашка',
    'correct-answer' => 'Винни-Пух'
    ],
	[
	'question' => 'Какой подарок ко дню рождения Сова подарила ослику Иа?',
	'answer1' => 'Горшок',
	'answer2' => 'Воздушный шар',
	'answer3' => 'Мед',
	'answer4' => 'Хвост',
    'correct-answer' => 'Хвост'
	],
	[
	'question' => 'Как зовут героя сказки, который от всех ушел?',
	'answer1' => 'Колобок',
	'answer2' => 'Вини-Пух',
	'answer3' => 'Иа',
	'answer4' => 'Заяц',
    'correct-answer' => 'Колобок'
]
];

echo $tests = json_encode($tests, JSON_UNESCAPED_UNICODE|JSON_PRETTY_PRINT);


$questions = file_get_contents(__DIR__.'/test1.json');
$q = json_decode($questions, true);

echo "<pre>";
print_r($q);

?>